gian793/stm32h7-cppLibrary/cmdCtrl/cmd.cpp
/**
 * \file            cmd.cpp
 * \brief           Commands class.
 * \author          giancarlo.marcolin@gmail.com
 */

// #include <algorithm>
// #include <array>
#include <cstdint>

// #include "stm32_lock.h"
#include "stm32h7xx_hal.h"
#include "cmdConfig.h"
#include "cmd.h"

/**
  * @brief  Commands executor. Must be invoked periodically.
  * @param  None.
  * @retval Command state.
  */

CmdState Cmd::execute( void ) 
{
    if( type != CmdType::noCmd )
    {
        uint32_t timerMs = HAL_GetTick();

        switch( state )
        {
            case CmdState::Done:
                state = CmdState::Idle;
            case CmdState::Idle:
                if( ( timerMs - delayTimerMs ) >= delayMs )
                {
                    delayTimerMs   = timerMs - delayTimerMs - delayMs;
                    timeoutTimerMs = timerMs;

                    pObj->send();

                    state = CmdState::Sent;
                }
                break; 
            
            case CmdState::Sent:
                state = ( replyType != CmdType::noCmd ) ? CmdState::WaitForReply : CmdState::Done;
            case CmdState::WaitForReply:

                if( isReplied )
                {
                    state = CmdState::Done;
                }
                else if( ( timerMs - timeoutTimerMs ) >= timeoutMs )
                {
                    state = CmdState::Timeout;
                }
                break; 
            
            case CmdState::Timeout:
                break; 

            default:
                break;
        }
    }

    return state;
};


/**
  * @brief  Return the current timer in [ms]
  * @param  None.
  * @retval Timer [ms] value.
  */

uint32_t Cmd::getTimerMs( void ) const
{
    return HAL_GetTick();
}